{"sessions":[  
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "id": 2,
        "name": "Manan  Wason"
      }
    ],
    "description": "This workshop will be for students from 12-17. We plan to teach them some basics of android by doing a sample android project.",
    "title": "Mobile development for students",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-18T13:30:00",
    "end_time": "2016-03-18T14:00:00",
    "type": "Workshop of 2 hours"
  },
  {
    "py/object": "models.Session",
    "speakers": [
    ],
    "description": "",
    "title": "Pub Crawl",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-18T19:00:00",
    "end_time": "2016-03-18T22:00:00",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "id": 5,
        "name": "Praveen (Gnovi) Patil "
      }
    ],
    "description": "Pocket Science Lab is yet another ambitious project from FOSSASIA  with the objective to develop open source hardware and software technology to improve science education by changing the way we teach and learn. PSL@FOSSASIA   aims to deliver low-cost lab equipments to millions of students and young scientists and enable them to learn science by experimenting and exploring.  The main components of PSL are  ExpEYES: Experiments for Young Engineers and Scientists [1] and MicroHope: Micro-controllers for Hobby Projects and Education [2] , projects by Dr. Ajith Kumar B P of IUAC, New Delhi [3].  ExpEYES is an Open Hardware and Free Software framework for developing science experiments, classroom demonstrations and projects without getting in to the details of electronics or computer programming. It converts your PC into a portable science laboratory.   In this workshop participants will be able to do hands-on science experiments  covering various concepts like electricity, electromagnetic induction, sound, interference, oscillations etc...  This workshop is for kids of any age [10 to 100 years :) ] who are interested in science hacks :)  [1] ExpEYES: http://www.expeyes.in  [2] MicroHope:  http://www.microhope.org [3] IUAC:  http://iuac.res.in/ [4] PSL: http://fossasia.github.io/pslab.fossasia.org/ ",
    "title": "Pocket Science Lab  - Learn Science by Exploring and Experimenting ",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-19T10:30:00",
    "end_time": "2016-03-19T11:00:00",
    "type": "Workshop of 2 hours"
  },
  {
    "py/object": "models.Session",
    "speakers": [
    ],
    "description": "",
    "title": "Group Photo",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-19T12:00:00",
    "end_time": "2016-03-19T12:15:00",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [
    ],
    "description": "",
    "title": "Lunch",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-19T12:15:00",
    "end_time": "2016-03-19T13:30:00",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "id": 8,
        "name": "Martin Bähr"
      }
    ],
    "description": "Roassal is a highlevel framework for visualizing data written in Smalltalk. In this workshop we will use it to build an interactive mind-mapping application. You will learn about development in Pharo Smalltalk in a hands-on approach.",
    "title": "Building a mind-mapping application in smalltalk using roassal",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-19T13:30:00",
    "end_time": "2016-03-19T14:00:00",
    "type": "Workshop of 2 hours"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "id": 9,
        "name": "Jigyasa Grover"
      }
    ],
    "description": "With over one billion devices activated, Android is an exciting space to make apps to help you communicate, organize, educate, entertain or anything else you’re passionate about.  Clearly there’s a demand for Android app development, and it’s turning the platform with the lovable green mascot into more and more of a strong first choice rather than just a secondary option.  So if you’ve been intent on, thinking about, or simply playing with the idea of learning Android… Make Your First Android App is here for you!  The session aims at introducing budding developers with the basic concepts and terminology in Android Development. It shall begin from scratch and discuss how to setup the environment and build a very own personal Android App with a Splash Screen for starters.",
    "title": "Workshop: Make Your First Android App",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-19T15:30:00",
    "end_time": "2016-03-19T16:00:00",
    "type": "Workshop of 2 hours"
  },
  {
    "py/object": "models.Session",
    "speakers": [
    ],
    "description": "",
    "title": "Social Event",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-19T18:00:00",
    "end_time": "2016-03-19T18:30:00",
    "type": ""
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "id": 2,
        "name": "Manan  Wason"
      }
    ],
    "description": "This workshop will be for students from 12-17. We plan to teach them some basics of android by doing a sample android project.",
    "title": "Mobile development for students",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-20T10:00:00",
    "end_time": "2016-03-20T10:30:00",
    "type": "Workshop of 2 hours"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "id": 11,
        "name": "Elda Webb"
      }
    ],
    "description": "Innovation depends on developing creative solutions for the complicated challenges we will be facing in the future, but what happens if we want to start innovating but we believe that we are not creative? During this workshop, participants will be exposed to tools and techniques that will help them understand that enhancing their creative confidence is like a muscle, you need to exercise it and practice daily. During the workshop the participants will be able to start their maker journey by personalizing a notebook/treasure box. Workshop is focus for following ages: 4- ­6 with parents, 7-13, 15 onwards",
    "title": "Creative Confidence",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-20T13:00:00",
    "end_time": "2016-03-20T13:30:00",
    "type": "Workshop of 1 hour"
  },
  {
    "py/object": "models.Session",
    "speakers": [
      {
        "id": 12,
        "name": "Ulrich Norbisrath"
      }
    ],
    "description": "Ulrich Norbisrath, PhD has more than 20 years of industrial and academic experience in Software Engineering and Systems Integration. He has supported the start-up of several software development companies as well as consulted tech companies in questions of Systems Integration, Mobile, and Cloud Computing. He provides a deep technical understanding of mobile technologies and their integration with cloud services -- both from an academic as well as an industrial perspective. He raised significant grants on Cloud, Mobile, and High Performance Computing at universities in Europe and Central Asia. He is a published book author in the area of Software and Requirements Engineering. Being connected through his immediate family to US Diplomatic services, he is very well traveled and can call on a worldwide network of international experts. He is currently employed as a professor at the University Applied Sciences Upper Austria in their Mobile Computing program.",
    "title": "Tech Kids",
    "track": {
      "id": 1,
      "name": "Tech Kids I"
    },
    "start_time": "2016-03-20T13:30:00",
    "end_time": "2016-03-20T14:00:00",
    "type": "Make your Internet of Things Espressive"
  }
]}